# Лабораторная работа №7.4. Словарь
students = [
    {
        "Фамилия": "Иванов",
        "Имя": "Иван",
        "Пол": "М",
        "Возраст": 20,
        "Группа": "Группа 107",
        "Оценка по математике": 5,
        "Оценка по физике": 4,
        "Оценка по химии": 4,
        
    },
    
    {
        "Фамилия": "Петров",
        "Имя": "Петр",
        "Пол": "М",
        "Возраст": 21,
        "Группа": "Группа 101",
        "Оценка по математике": 4,
        "Оценка по физике": 5,
        "Оценка по химии": 3
    },
    {
        "Фамилия": "Сидорова",
        "Имя": "Мария",
        "Пол": "Ж",
        "Возраст": 19,
        "Группа": "Группа 304",
        "Оценка по математике": 5,
        "Оценка по физике": 5,
        "Оценка по химии": 5
    },
    {
        "Фамилия": "Сидорова",
        "Имя": "Александра",
        "Пол": "Ж",
        "Возраст": 19,
        "Группа": "Группа 302",
        "Оценка по математике": 2,
        "Оценка по физике": 2,
        "Оценка по химии": 2
    },
    {
        "Фамилия": "Макаров",
        "Имя": "Антон",
        "Пол": "М",
        "Возраст": 22,
        "Группа": "Группа 102",
        "Оценка по математике": 3,
        "Оценка по физике": 4,
        "Оценка по химии": 4
    },
    {
        "Фамилия": "Филиппова",
        "Имя": "Ольга",
        "Пол": "Ж",
        "Возраст": 18,
        "Группа": "Группа 220",
        "Оценка по математике": 4,
        "Оценка по физике": 2,
        "Оценка по химии": 5
    },
    {
        "Фамилия": "Осипова",
        "Имя": "Анастасия",
        "Пол": "Ж",
        "Возраст": 20,
        "Группа": "Группа 208",
        "Оценка по математике": 2,
        "Оценка по физике": 4,
        "Оценка по химии": 4
    },
    {
        "Фамилия": "Толстова",
        "Имя": "София",
        "Пол": "Ж",
        "Возраст": 20,
        "Группа": "Группа 208",
        "Оценка по математике": 5,
        "Оценка по физике": 5,
        "Оценка по химии": 5
    },
    {
        "Фамилия": "Гончарова",
        "Имя": "Ксения",
        "Пол": "Ж",
        "Возраст": 20,
        "Группа": "Группа 208",
        "Оценка по математике": 3,
        "Оценка по физике": 3,
        "Оценка по химии": 4
    },
    {
        "Фамилия": "Антипов",
        "Имя": "Кирилл",
        "Пол": "М",
        "Возраст": 18,
        "Группа": "Группа 410",
        "Оценка по математике": 1,
        "Оценка по физике": 1,
        "Оценка по химии": 1
    },
]


def avg(student):
    return (student["Оценка по математике"] + student["Оценка по физике"] + student["Оценка по химии"]) / 3


top_students = sorted(students, key=avg, reverse=True)

for i, student in enumerate(top_students):
    print(f"Место {i + 1}: {student['Фамилия']} {student['Имя']}, средний балл: {avg(student)}")

